# Pivot tables with pandas
##### >>> representing datas as pivot tables

In [1]:
# --> Pivot tables helps reorganize data, refactor cell based on new column & index from existing datatables

# ---> i.e, dataframe tables with repeated values can be pivoted for reorganize & clarity

# NB **--> new index & columns for the pivot tables should have a repeating values in original data table / dataframe

#---> & then we decide what coumn values we can used to match up the cell(row) values

#-----> NB:- ***no new information is shown in pivot tables & it is just a re-organize of the datatable with some column droped for clarity

#-----> NB: Dont make pivot tables for every dtstsble & onlycreate pivot tables only for datables that makes sense
# **( ALso --> crating pivot for most datables will makes no sense )

In [3]:
#intuition checklist to make pivot table ----> what we want to answer from dtatble

#----> does it need a pivot table ---> what we want it to look like

#---> does it asnswer the questions 

#----> we can also call aggragate methods on pivot tables methods  

#-----> NB ** we can answer this sort of Qs using GroupBy in pandas which is more convinient than to use pivot tables which can again depends on csituation

In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv('Sales_Funnel_CRM.csv')

In [7]:
df

,Account Number,Company,Contact,Account Manager,Product,Licenses,Sale Price,Status
0,2123398,Google,Larry Pager,Edward Thorp,Analytics,150,2100000,Presented
1,2123398,Google,Larry Pager,Edward Thorp,Prediction,150,700000,Presented
2,2123398,Google,Larry Pager,Edward Thorp,Tracking,300,350000,Under Review
3,2192650,BOBO,Larry Pager,Edward Thorp,Analytics,150,2450000,Lost
4,420496,IKEA,Elon Tusk,Edward Thorp,Analytics,300,4550000,Won
5,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Analytics,300,2800000,Under Review
6,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Prediction,150,700000,Presented
7,1216870,Microsoft,Will Grates,Edward Thorp,Tracking,300,350000,Under Review
8,2200450,Walmart,Will Grates,Edward Thorp,Analytics,150,2450000,Lost
9,405886,Apple,Cindy Phoner,Claude Shannon,Analytics,300,4550000,Won
10,470248,Exxon Mobile,Cindy Phoner,Claude Shannon,Analytics,150,2100000,Presented
11,698032,ATT,Cindy Phoner,Claude Shannon,Tracking,150,350000,Under Review
12,698032,ATT,Cindy Phoner,Claude Shannon,Prediction,150,700000,Presented
13,902797,CVS Health,Emma Gordian,Claude Shannon,Tracking,450,490000,Won
14,2046943,Salesforce,Emma Gordian,Claude Shannon,Analytics,750,7000000,Won
15,2169499,Cisco,Emma Gordian,Claude Shannon,Analytics,300,4550000,Lost
16,2169499,Cisco,Emma Gordian,Claude Shannon,GPS Positioning,300,350000,Presented

In [10]:
# CRM --> customer relation management datas ---> common for peaple creating pivot for this type of datatables to get clarity on its data

#help(pd.pivot) ---> doc on .pivot() method in pandas

In [16]:
# eg -- how many licenses of products did Google purchase ?

# ---> select 3 0r more column from datable we want to work with

license = df[['Company', 'Product', 'Licenses']]  #---> taking subset of column we want to work with

#NB--> we dont typpically need pivot tables to answer such Qs but it makes lot easier if datatable is very large

In [17]:
license

         Company          Product  Licenses
0         Google        Analytics       150
1         Google       Prediction       150
2         Google         Tracking       300
3           BOBO        Analytics       150
4           IKEA        Analytics       300
5     Tesla Inc.        Analytics       300
6     Tesla Inc.       Prediction       150
7      Microsoft         Tracking       300
8        Walmart        Analytics       150
9          Apple        Analytics       300
10  Exxon Mobile        Analytics       150
11           ATT         Tracking       150
12           ATT       Prediction       150
13    CVS Health         Tracking       450
14    Salesforce        Analytics       750
15         Cisco        Analytics       300
16         Cisco  GPS Positioning       300

In [20]:
# we can call pivot to craete pivot table

pd.pivot(data=license, index='Company', columns='Product', values='Licenses')  # ---> fill rows with null if it index(Company) has no values for columns(Products)

#---> i.e it is lot easier to answer to Qs like how many product licences sold to ech company

Product       Analytics  GPS Positioning  Prediction  Tracking
Company
 Google           150.0              NaN       150.0     300.0
ATT                 NaN              NaN       150.0     150.0
Apple             300.0              NaN         NaN       NaN
BOBO              150.0              NaN         NaN       NaN
CVS Health          NaN              NaN         NaN     450.0
Cisco             300.0            300.0         NaN       NaN
Exxon Mobile      150.0              NaN         NaN       NaN
IKEA              300.0              NaN         NaN       NaN
Microsoft           NaN              NaN         NaN     300.0
Salesforce        750.0              NaN         NaN       NaN
Tesla Inc.        300.0              NaN       150.0       NaN
Walmart           150.0              NaN         NaN       NaN

In [21]:
# Nb --> we can answer this Qs eith without using pivot tables using pandas filter method approch
#-----> But in pivot tables we can compare & answer qustion on multiple questions

In [34]:
# Aggregate on pivot tables ---> this is when we use .pivot_table() mrthod calls
 
    #eg --.> total sum of sales & license for each company


pd.pivot_table(df, index='Company', aggfunc='sum')  # ---> perform aggregate sum for all numerical dtpe column for given index(which is grooupby)

,Account Manager,Account Number,Contact,Licenses,Product,Sale Price,Status
Company,,,,,,,
Google,Edward ThorpEdward ThorpEdward Thorp,6370194,Larry PagerLarry PagerLarry Pager,600,AnalyticsPredictionTracking,3150000,PresentedPresentedUnder Review
ATT,Claude ShannonClaude Shannon,1396064,Cindy PhonerCindy Phoner,300,TrackingPrediction,1050000,Under ReviewPresented
Apple,Claude Shannon,405886,Cindy Phoner,300,Analytics,4550000,Won
BOBO,Edward Thorp,2192650,Larry Pager,150,Analytics,2450000,Lost
CVS Health,Claude Shannon,902797,Emma Gordian,450,Tracking,490000,Won
Cisco,Claude ShannonClaude Shannon,4338998,Emma GordianEmma Gordian,600,AnalyticsGPS Positioning,4900000,LostPresented
Exxon Mobile,Claude Shannon,470248,Cindy Phoner,150,Analytics,2100000,Presented
IKEA,Edward Thorp,420496,Elon Tusk,300,Analytics,4550000,Won
Microsoft,Edward Thorp,1216870,Will Grates,300,Tracking,350000,Under Review
Salesforce,Claude Shannon,2046943,Emma Gordian,750,Analytics,7000000,Won
Tesla Inc.,Edward ThorpEdward Thorp,1273370,Elon TuskElon Tusk,450,AnalyticsPrediction,3500000,Under ReviewPresented
Walmart,Edward Thorp,2200450,Will Grates,150,Analytics,2450000,Lost

In [36]:
#help(pd.pivot_table) ----> doc

In [37]:

pd.pivot_table(df, index='Company', aggfunc={'Licenses':'sum', 'Sale Price': 'sum'}) # --> returns aggr on only columns we want

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000

In [42]:
pd.pivot_table(df, index='Company', aggfunc='sum', values=['Licenses', 'Sale Price'])

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000

In [41]:
# we can use Grropby() memthod instead --> Recommended**

df.groupby('Company').sum()[['Licenses', 'Sale Price']]

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000

In [43]:
# Pivot tables for multi index tables ----> * recomend we can use Gropby mrhod insted

df

,Account Number,Company,Contact,Account Manager,Product,Licenses,Sale Price,Status
0,2123398,Google,Larry Pager,Edward Thorp,Analytics,150,2100000,Presented
1,2123398,Google,Larry Pager,Edward Thorp,Prediction,150,700000,Presented
2,2123398,Google,Larry Pager,Edward Thorp,Tracking,300,350000,Under Review
3,2192650,BOBO,Larry Pager,Edward Thorp,Analytics,150,2450000,Lost
4,420496,IKEA,Elon Tusk,Edward Thorp,Analytics,300,4550000,Won
5,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Analytics,300,2800000,Under Review
6,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Prediction,150,700000,Presented
7,1216870,Microsoft,Will Grates,Edward Thorp,Tracking,300,350000,Under Review
8,2200450,Walmart,Will Grates,Edward Thorp,Analytics,150,2450000,Lost
9,405886,Apple,Cindy Phoner,Claude Shannon,Analytics,300,4550000,Won
10,470248,Exxon Mobile,Cindy Phoner,Claude Shannon,Analytics,150,2100000,Presented
11,698032,ATT,Cindy Phoner,Claude Shannon,Tracking,150,350000,Under Review
12,698032,ATT,Cindy Phoner,Claude Shannon,Prediction,150,700000,Presented
13,902797,CVS Health,Emma Gordian,Claude Shannon,Tracking,450,490000,Won
14,2046943,Salesforce,Emma Gordian,Claude Shannon,Analytics,750,7000000,Won
15,2169499,Cisco,Emma Gordian,Claude Shannon,Analytics,300,4550000,Lost
16,2169499,Cisco,Emma Gordian,Claude Shannon,GPS Positioning,300,350000,Presented

In [47]:
 # eg - we want to know total licenses sold  & total contact made by Account mangaer

#---> we want to groupby Account manager & contact and get total soles price per contact

pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', aggfunc='sum')  # ----> return multi indes pivot table with Sale Price as column 
                                                                                  #showing sum of total sale price made by account amager to each oftheir contacts

                              Sale Price
Account Manager Contact
Claude Shannon  Cindy Phoner     7700000
                Emma Gordian    12390000
Edward Thorp    Elon Tusk        8050000
                Larry Pager      5600000
                Will Grates      2800000

In [49]:
# NB - columns in pivot table are optional & aggretion is applied to values we list

pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', columns=['Product'], aggfunc='sum')


# ---> we ll see Sale Price separeated out by list of product type column ---> Two tier of multi index level for both index & column

Product                        Analytics  GPS Positioning  Prediction  \
Account Manager Contact
Claude Shannon  Cindy Phoner   6650000.0              NaN    700000.0
                Emma Gordian  11550000.0         350000.0         NaN
Edward Thorp    Elon Tusk      7350000.0              NaN    700000.0
                Larry Pager    4550000.0              NaN    700000.0
                Will Grates    2450000.0              NaN         NaN

Product                       Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner  350000.0
                Emma Gordian  490000.0
Edward Thorp    Elon Tusk          NaN
                Larry Pager   350000.0
                Will Grates   350000.0

In [50]:
pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', columns=['Product'], aggfunc='sum', fill_value=0)

# fills NAN null values with zero

Product                       Analytics  GPS Positioning  Prediction  Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner    6650000                0      700000    350000
                Emma Gordian   11550000           350000           0    490000
Edward Thorp    Elon Tusk       7350000                0      700000         0
                Larry Pager     4550000                0      700000    350000
                Will Grates     2450000                0           0    350000

In [52]:
#NB :- we can also pass list of multiple numpy aggregate calls 
pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', columns=['Product'], aggfunc=[np.sum, np.mean], fill_value=0)

# ----> we get sum of both sale price & mean of mean of sale price

<ipython-input-52-7f4779c780e4>:2: FutureWarning: The provided callable <function sum at 0x13fb840> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', columns=['Product'], aggfunc=[np.sum, np.mean], fill_value=0)
<ipython-input-52-7f4779c780e4>:2: FutureWarning: The provided callable <function mean at 0x2e68410> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact'], values='Sale Price', columns=['Product'], aggfunc=[np.sum, np.mean], fill_value=0)

                                   sum                                      \
Product                      Analytics GPS Positioning Prediction Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner   6650000               0     700000   350000
                Emma Gordian  11550000          350000          0   490000
Edward Thorp    Elon Tusk      7350000               0     700000        0
                Larry Pager    4550000               0     700000   350000
                Will Grates    2450000               0          0   350000

                                   mean
Product                       Analytics GPS Positioning Prediction  Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner  3325000.0             0.0   700000.0  350000.0
                Emma Gordian  5775000.0        350000.0        0.0  490000.0
Edward Thorp    Elon Tusk     3675000.0             0.0   700000.0       0.0
                Larry Pager   2275000.0             0.0   700000.0  350000.0
                Will Grates   2450000.0             0.0        0.0  350000.0

In [53]:
# NB - Pivot table can get really mess & hard to read as we aggregate too much datas on it

In [54]:
pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0) # having product as 3rd index

<ipython-input-54-e8ceede53541>:1: FutureWarning: The provided callable <function sum at 0x13fb840> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0) # having product as 3rd index
<ipython-input-54-e8ceede53541>:1: FutureWarning: The provided callable <function mean at 0x2e68410> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0) # having product as 3rd index

                                                    sum       mean
                                             Sale Price Sale Price
Account Manager Contact      Product
Claude Shannon  Cindy Phoner Analytics          6650000  3325000.0
                             Prediction          700000   700000.0
                             Tracking            350000   350000.0
                Emma Gordian Analytics         11550000  5775000.0
                             GPS Positioning     350000   350000.0
                             Tracking            490000   490000.0
Edward Thorp    Elon Tusk    Analytics          7350000  3675000.0
                             Prediction          700000   700000.0
                Larry Pager  Analytics          4550000  2275000.0
                             Prediction          700000   700000.0
                             Tracking            350000   350000.0
                Will Grates  Analytics          2450000  2450000.0
                             Tracking            350000   350000.0

In [56]:
# margin option ----> false by default---> we canset to true to give grand margin

pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0, margins=True)

<ipython-input-56-a756b75543a7>:3: FutureWarning: The provided callable <function sum at 0x13fb840> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0, margins=True)
<ipython-input-56-a756b75543a7>:3: FutureWarning: The provided callable <function mean at 0x2e68410> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df, index=['Account Manager', 'Contact', 'Product'], values='Sale Price', aggfunc=[np.sum, np.mean], fill_value=0, margins=True)

                                                    sum          mean
                                             Sale Price    Sale Price
Account Manager Contact      Product
Claude Shannon  Cindy Phoner Analytics          6650000  3.325000e+06
                             Prediction          700000  7.000000e+05
                             Tracking            350000  3.500000e+05
                Emma Gordian Analytics         11550000  5.775000e+06
                             GPS Positioning     350000  3.500000e+05
                             Tracking            490000  4.900000e+05
Edward Thorp    Elon Tusk    Analytics          7350000  3.675000e+06
                             Prediction          700000  7.000000e+05
                Larry Pager  Analytics          4550000  2.275000e+06
                             Prediction          700000  7.000000e+05
                             Tracking            350000  3.500000e+05
                Will Grates  Analytics          2450000  2.450000e+06
                             Tracking            350000  3.500000e+05
All                                            36540000  2.149412e+06

In [57]:
# Thats it for pivot table with pandas dataframe